app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."site_id" = ? LIMIT 1  [["site_id", 1]]
SELECT "posts".* FROM "posts"
---
    def index

      # NOTE : Move Posts Faraday fetch HERE
        if params[:site_id]
            render json: Post.where(["site_id LIKE ?", "%#{params[:site_id]}%"])
        else
            render json: Post.all