app/controllers/searches_controller.rb

SELECT "site_searches".* FROM "site_searches" WHERE "site_searches"."search_id" = ?  [["search_id", 1]]
---
    def index
        searches = Search.all

SELECT "site_searches".* FROM "site_searches" WHERE "site_searches"."search_id" = ?  [["search_id", 1]]
---
    def show
        search = Search.find(params[:id])