app/controllers/sites_controller.rb

    def index
        sites = Site.all
---
SELECT "sites".* FROM "sites"

    def show
        site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 1]]